import pandas as pd
import numpy as np

data = {
    "Ученик": ["Кузнецов", "Петрова", "Николаев", "Фокин", "Заплетин",
               "Смирнова", "Дывыдов", "Сидоров", "Иванова", "Григорьев"],

    'Математика': [5, 4, 3, 5, 4, 3, 5, 4, 3, 5],
    'Физика': [4, 3, 5, 4, 3, 4, 5, 4, 3, 4],
    'Химия': [3, 4, 4, 5, 3, 4, 3, 5, 4, 3],
    'Литература': [5, 4, 5, 4, 5, 4, 3, 4, 5, 4],
    'История': [4, 5, 4, 3, 4, 5, 4, 3, 4, 5]
}

df = pd.DataFrame(data)

print("Первые 5 строк данных:")
print(df.head())


print("Средние оценки по предметам:")
print(f"Средняя оценка по предмету 'Математика'- {df['Математика'].mean()}")
print(f"Средняя оценка по предмету 'Физика'- {df['Физика'].mean()}")
print(f"Средняя оценка по предмету 'Химия'- {df['Химия'].mean()}")
print(f"Средняя оценка по предмету 'Литература'- {df['Литература'].mean()}")
print(f"Средняя оценка по предмету 'История'- {df['История'].mean()}")


print("Медианные оценки по предметам:")
print(f"Медианная оценка по предмету 'Математика'- {df['Математика'].median()}")
print(f"Медианная оценка по предмету 'Физика'- {df['Физика'].median()}")
print(f"Медианная оценка по предмету 'Химия'- {df['Химия'].median()}")
print(f"Медианная оценка по предмету 'Литература'- {df['Литература'].median()}")
print(f"Медианная оценка по предмету 'История'- {df['История'].median()}")


Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR_math = Q3_math - Q1_math

print("Статистика по математике:")
print(f"Q1 (25-й перцентиль): {Q1_math}")
print(f"Q3 (75-й перцентиль): {Q3_math}")
print(f"IQR (интерквартильный размах): {IQR_math}")


print(f"Стандартное отклонение по предмету 'Математика' - {df['Математика'].std()}")
print(f"Стандартное отклонение по предмету 'Физика' - {df['Физика'].std()}")
print(f"Стандартное отклонение по предмету 'Химия' - {df['Химия'].std()}")
print(f"Стандартное отклонение по предмету 'Литература' - {df['Химия'].std()}")
print(f"Стандартное отклонение по предмету 'История' - {df['История'].std()}")























